'''
Created on 2020. 8. 20.
@author: GDJ24
numpy2.py : numpy 예제. 기능 실습
'''

import numpy as np
x = np.arange(10) #0부터 9까지의 숫자로 이루어진 배열
print(x) #[0 1 2 3 4 5 6 7 8 9]
print(x[:5]) # [0 1 2 3 4]
print(x[5:]) # [5 6 7 8 9]
print(x[4:7]) # [4 5 6]
print(x[::2]) # [0 2 4 6 8]
print(x[1::2]) # [1 3 5 7 9]
print(x[1:8:3]) # [1 4 7]
print(x[::-1]) # [9 8 7 6 5 4 3 2 1 0]
print('♥')

#0부터 9까지의 난수를 4행 5열 배열에 저장
x = np.random.randint(10, size = (4,5))
print(x)
'''
[[5 5 8 3 7]
 [9 4 7 6 9]
 [7 6 2 7 9]
 [0 7 8 5 9]]
'''
#2개의 행과 3개의 열
print(x[:2,:3])
'''
[[5 5 8]
 [9 4 7]]
'''
#모든 행과 한개씩 걸러서 열 조회
print(x[:,::2])
'''
[[5 8 7]
 [9 7 9]
 [7 2 9]
 [0 8 9]]
'''
#행을 역으로 조회
print(x)
'''
[[5 5 8 3 7]
 [9 4 7 6 9]
 [7 6 2 7 9]
 [0 7 8 5 9]]
'''
print(x[::-1,::-1])
'''
[[9 5 8 7 0]
 [9 7 2 6 7]
 [9 6 7 4 9]
 [7 3 8 5 5]]
'''